In [3]:
import numpy as np
import pandas as pd

In [16]:
from numpy.random import randn

In [17]:
np.random.seed(101)

In [6]:
df = pd.DataFrame(randn(4,4),['A','B','C','D'],['W','X','Y','Z'])

In [7]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [8]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
Name: W, dtype: float64

In [9]:
type(df['X'])

pandas.core.series.Series

In [13]:
df['Z']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
Name: Z, dtype: float64

In [15]:
df[['W','Y']]  # To get multiple colums pass a list of columns in df

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237

In [16]:
df['new'] = df['W'] + df['Y']

In [17]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [20]:
df.drop('new', axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [21]:
df['new'] = randn(4)

In [22]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  0.190794
B  0.651118 -0.319318 -0.848077  0.605965  1.978757
C -2.018168  0.740122  0.528813 -0.589001  2.605967
D  0.188695 -0.758872 -0.933237  0.955057  0.683509

In [25]:
df.drop('new', axis=1)   # Wont delete the column permanently

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [26]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  0.190794
B  0.651118 -0.319318 -0.848077  0.605965  1.978757
C -2.018168  0.740122  0.528813 -0.589001  2.605967
D  0.188695 -0.758872 -0.933237  0.955057  0.683509

In [35]:
#instead use inplace= true
df.drop('new', axis= 1, inplace = True)

In [36]:
df   # new is removed permanently

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [37]:
df.shape

(4, 4)

In [38]:
#Selecting Rows

In [39]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [41]:
df.iloc[2]   # numerical base index selecting

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [42]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [43]:
df.loc['A','Y']

0.9079694464765431

In [44]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [46]:
df.loc[['A','C'],['W','Z']]   # Selecting subsets of the dataframes we pass list of rows and cols

          W         Z
A  2.706850  0.503826
C -2.018168 -0.589001

In [47]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

In [48]:
df_bool = df < 0

In [49]:
df_bool

       W      X      Y      Z
A  False  False  False  False
B  False   True   True  False
C   True  False  False   True
D  False   True   True  False

In [50]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [51]:
df['X'] > 0

A     True
B    False
C     True
D    False
Name: X, dtype: bool

In [53]:
df['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
Name: X, dtype: float64

In [54]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [55]:
df[df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [58]:
df[df['X'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001

In [59]:
df[df['X'] > 0]['Y']

A    0.907969
C    0.528813
Name: Y, dtype: float64

In [63]:
boolser = df['Y'] > 0

In [64]:
boolser

A     True
B    False
C     True
D    False
Name: Y, dtype: bool

In [68]:
res = df[boolser]

In [76]:
res[['X','Y']]

          X         Y
A  0.628133  0.907969
C  0.740122  0.528813

In [85]:
res.loc[['A'],['X','Y']]

          X         Y
A  0.628133  0.907969

In [86]:
df[df['W']>0][['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
D  0.188695  0.955057

In [87]:
# Multiple Conditions

In [89]:
df[(df['W'] > 0) and (df['X'] > 1)]  # It will give error bcoz normal boolean and does operation on single bool values
                                    #  but here it does the and operation on series of data

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [95]:
df[ (df['W'] > 1) & (df['Y'] > 0) ]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [93]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [96]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057

In [97]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [98]:
newindex = 'DL CG MP GJ'.split()

In [99]:
newindex

['DL', 'CG', 'MP', 'GJ']

In [102]:
df['States'] = newindex

In [103]:
df

          W         X         Y         Z states States
A  2.706850  0.628133  0.907969  0.503826     DL     DL
B  0.651118 -0.319318 -0.848077  0.605965     CG     CG
C -2.018168  0.740122  0.528813 -0.589001     MP     MP
D  0.188695 -0.758872 -0.933237  0.955057     GJ     GJ

In [111]:
df.drop('states', axis = 1, inplace=True)

In [112]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     DL
B  0.651118 -0.319318 -0.848077  0.605965     CG
C -2.018168  0.740122  0.528813 -0.589001     MP
D  0.188695 -0.758872 -0.933237  0.955057     GJ

In [114]:
df.set_index('States')

               W         X         Y         Z
States
DL      2.706850  0.628133  0.907969  0.503826
CG      0.651118 -0.319318 -0.848077  0.605965
MP     -2.018168  0.740122  0.528813 -0.589001
GJ      0.188695 -0.758872 -0.933237  0.955057

In [6]:
#Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [11]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [13]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [18]:
df1 = pd.DataFrame(randn(6,4),hier_index,['A','B','C','D'])

In [19]:
df1

             A         B         C         D
G1 1  2.706850  0.628133  0.907969  0.503826
   2  0.651118 -0.319318 -0.848077  0.605965
   3 -2.018168  0.740122  0.528813 -0.589001
G2 1  0.188695 -0.758872 -0.933237  0.955057
   2  0.190794  1.978757  2.605967  0.683509
   3  0.302665  1.693723 -1.706086 -1.159119

In [20]:
df1.loc['G1']

          A         B         C         D
1  2.706850  0.628133  0.907969  0.503826
2  0.651118 -0.319318 -0.848077  0.605965
3 -2.018168  0.740122  0.528813 -0.589001

In [25]:
df1.loc[['G1'],['A','B']]

             A         B
G1 1  2.706850  0.628133
   2  0.651118 -0.319318
   3 -2.018168  0.740122

In [27]:
df1.loc[[['G1',1],['G2',3]],['A','B']]

             A         B
G1 1  2.706850  0.628133
G2 3  0.302665  1.693723

In [28]:
df1.index.names = ['Groups','Num']

In [29]:
df1

                   A         B         C         D
Groups Num
G1     1    2.706850  0.628133  0.907969  0.503826
       2    0.651118 -0.319318 -0.848077  0.605965
       3   -2.018168  0.740122  0.528813 -0.589001
G2     1    0.188695 -0.758872 -0.933237  0.955057
       2    0.190794  1.978757  2.605967  0.683509
       3    0.302665  1.693723 -1.706086 -1.159119

In [32]:
df1.loc['G2'].loc[1,'C']

-0.9332372163009188

In [36]:
df1.xs(1,level='Num')

               A         B         C         D
Groups
G1      2.706850  0.628133  0.907969  0.503826
G2      0.188695 -0.758872 -0.933237  0.955057